Extensions/УВМ/DataProcessors/УВМ_ОбработкаРуководителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УВМ_ОбработкаРуководителей</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Extensions/УВМ/InformationRegisters/УВМ_Руководители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УВМ_Руководители</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КадровыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.КадровыйПеревод</v8:Type>
						<v8:Type>cfg:DocumentRef.КадровыйПереводСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.Увольнение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/УВМ/DataProcessors/УВМ_ОбработкаРуководителей/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПоменятьРуководителяНаСервере()
	
	МсвПодчиненных = УВМ_ОбщиеДоработки.ПодчиненныеСотрудника(СтарыйРуководитель);
	
	Для Каждого ТекущийПодчиненный Из МсвПодчиненных Цикл
		МенеджерЗаписи = РегистрыСведений.УВМ_Руководители.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ДатаСмены;
		МенеджерЗаписи.Физлицо = ТекущийПодчиненный;
		МенеджерЗаписи.Руководитель = НовыйРуководитель;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоменятьРуководителя(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДатаСмены) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен реквизит 'Дата смены'", , "ДатаСмены");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтарыйРуководитель) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен реквизит 'Старый руководитель'", , "СтарыйРуководитель");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(НовыйРуководитель) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен реквизит 'Новый руководитель'", , "НовыйРуководитель");
		Возврат;
	КонецЕсли;

	ПоменятьРуководителяНаСервере();
КонецПроцедуры

&НаСервере
Процедура НазначитьРуководителяНаСервере()

	Для Каждого СтрокаТЧ Из Подчиненные Цикл	
		МенеджерЗаписи = РегистрыСведений.УВМ_Руководители.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ДатаНазначения;
		МенеджерЗаписи.Физлицо = СтрокаТЧ.Значение;
		МенеджерЗаписи.Руководитель = Руководитель;
		МенеджерЗаписи.Записать();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура НазначитьРуководителя(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДатаНазначения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен реквизит 'Дата назначения'", , "ДатаНазначения");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Руководитель) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен реквизит 'Руководитель'", , "Руководитель");
		Возврат;
	КонецЕсли;

	НазначитьРуководителяНаСервере();
	
КонецПроцедуры
